src/cf/DataProcessors/Демонстрационная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>Демонстрационная</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/AccountingRegisters/ОсновнойРегистрБухгалтерии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>ОсновнойРегистрБухгалтерии</Name>
			<ChartOfAccounts>ChartOfAccounts.ОсновнойПланСчетов</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ОсновнойПланСчетов.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ОсновнойПланСчетов.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ОсновнойПланСчетов.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ОсновнойПланСчетов.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ОсновнойПланСчетов.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаХолдинга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

src/cf/Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПриходнаяНакладная</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.ОсновнойРегистрБухгалтерии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Всего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/ChartsOfAccounts/ОсновнойПланСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfAccounts>
		<Properties>
			<Name>ОсновнойПланСчетов</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<AccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Суммовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

src/cf/DataProcessors/Демонстрационная/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура НеПравильно(Команда)
	
	ПолучитьОстатокПоСчету(Остаток);
	
КонецПроцедуры

&НаКлиенте
Процедура Правильно(Команда)
	
	ПолучитьОстатокПоСчету2(Остаток);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьОстатокПоСчету(Остаток)
	
	Остаток = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Остатки.СуммаОстаток
	|ИЗ
	|	РегистрБухгалтерии.ОсновнойРегистрБухгалтерии.Остатки(, Счет.Код = ""1.1"",	, ) КАК Остатки";
	
	Остатки = Запрос.Выполнить().Выбрать();
	Остатки.Следующий();
	Остаток = Остатки.СуммаОстаток;	

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьОстатокПоСчету2(Остаток)
	
	Остаток = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Остатки.СуммаОстаток
	|ИЗ
	|	РегистрБухгалтерии.ОсновнойРегистрБухгалтерии.Остатки(, Счет = &Счет, , ) КАК Остатки";
	
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.ОсновнойПланСчетов.Касса);

	Остатки = Запрос.Выполнить().Выбрать();
	Остатки.Следующий();
	Остаток = Остатки.СуммаОстаток;	

КонецПроцедуры

&НаКлиенте
Процедура СвойстваСубконтоСчета(Команда)

	ВывестиСвойстваВидаСубконто(Счет);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиСвойстваВидаСубконто(Счет)
	
	Сообщение = Новый СообщениеПользователю();
	
	Для Каждого ВидСубконто Из Счет.ВидыСубконто Цикл
		
		Вид = ВидСубконто.ВидСубконто;
	
		ТипЗначения = Вид.ТипЗначения;
		Наименование = Вид.Наименование; 
			
		ВведенВКонфигураторе = ВидСубконто.Предопределенное;
		Оборотный = ВидСубконто.ТолькоОбороты;
		Количественный = ВидСубконто.Количественный;
		Суммовой = ВидСубконто.Суммовой;

		Сообщение.Текст = "Вид субконто: " + Наименование + ", Предопределенное - " + Строка(ВведенВКонфигураторе) + 
						", Оборотный - " + Строка(Оборотный) + ", Количественный - " + Строка(Количественный) +
						", Суммовой - " + Строка(Суммовой);
		Сообщение.Сообщить();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСвойстваСубконтоСчета(Команда)
	
	ЗаполнитьСвойстваСубконтоНаСервере();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСвойстваСубконтоНаСервере()
	
	Счет = ПланыСчетов.ОсновнойПланСчетов.Касса;
	ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.Сотрудники;
	
	Если Счет.ВидыСубконто.Найти(ВидСубконто,"ВидСубконто")= Неопределено Тогда
		
		СчетОбъект = Счет.ПолучитьОбъект();
	
		НовыйВид = СчетОбъект.ВидыСубконто.Добавить();
		НовыйВид.ВидСубконто = ВидСубконто;
		НовыйВид.Суммовой = Истина;
		НовыйВид.Количественный = Истина;
		
		СчетОбъект.Записать();
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаписьДвиженийБезПроведенияДокумента(Команда)
	
	ЗаписьДвиженийБезПроведенияНаСервере();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписьДвиженийБезПроведенияНаСервере()
	
	Приходные = Документы.ПриходнаяНакладная.Выбрать();
	
	Пока Приходные.Следующий() Цикл
		ПриходнаяОбъект = Приходные.ПолучитьОбъект();
		Проводки = ПриходнаяОбъект.Движения.ОсновнойРегистрБухгалтерии;

		НоваяПроводка = Проводки.Добавить();
		НоваяПроводка.Период = ПриходнаяОбъект.Дата;
		НоваяПроводка.Организация = ПриходнаяОбъект.Организация;
		НоваяПроводка.СчетДт = ПланыСчетов.ОсновнойПланСчетов.Товары;
		НоваяПроводка.СчетКт = ПланыСчетов.ОсновнойПланСчетов.Поставщики;
		НоваяПроводка.Сумма = ПриходнаяОбъект.Всего;

		Проводки.Записать(Ложь);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписьДвиженийСПомощьюНабораЗаписей(Команда)
	
	ЗаписьДвиженийСПомощьюНабораЗаписейНаСервере();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписьДвиженийСПомощьюНабораЗаписейНаСервере()
	
	Приходные = Документы.ПриходнаяНакладная.Выбрать();
	
	Проводки = РегистрыБухгалтерии.ОсновнойРегистрБухгалтерии.СоздатьНаборЗаписей();
	
	Пока Приходные.Следующий() Цикл
		ПриходнаяСсылка = Приходные.Ссылка;
		Проводки.Отбор.Регистратор.Установить(ПриходнаяСсылка);

		НоваяПроводка = Проводки.Добавить();
		НоваяПроводка.Период = ПриходнаяСсылка.Дата;
		НоваяПроводка.Организация = ПриходнаяСсылка.Организация;
		НоваяПроводка.СчетДт = ПланыСчетов.ОсновнойПланСчетов.Товары;
		НоваяПроводка.СчетКт = ПланыСчетов.ОсновнойПланСчетов.Поставщики;
		НоваяПроводка.Сумма  = ПриходнаяСсылка.Всего;

		Проводки.Записать(Ложь);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПоВалютнымСчетам(Команда)
	
	ПолучитьОстаткиПоВалютнымСчетам();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьОстаткиПоВалютнымСчетам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|		Остатки.Счет,
	|		Остатки.Валюта,
	|		Остатки.ВалютнаяСуммаОстаток,
	|		Остатки.СуммаОстаток
	|ИЗ
	|	РегистрБухгалтерии.ОсновнойРегистрБухгалтерии.Остатки(, Счет.Валютный = ИСТИНА, , ) КАК Остатки";
	
	Результат = Запрос.Выполнить();
   	Остатки = Результат.Выбрать();
	
	ТЗ.Очистить();
	Пока Остатки.Следующий() Цикл
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.Счет = Остатки.Счет;
		НоваяСтрока.Валюта = Остатки.Валюта;
		НоваяСтрока.ВалютнаяСуммаОстаток = Остатки.ВалютнаяСуммаОстаток;
		НоваяСтрока.СуммаОстаток = Остатки.СуммаОстаток;
	КонецЦикла;

КонецПроцедуры
